s= ''' Было просто пасмурно, дуло с севера
А к обеду насчитал сто градаций серого. 
Так всегда первого ноль  девятого, то ли весь мир сошел с ума, то ли я - того...
На столе записка от нее  смятая, 
недопитый виски допиваю с матами.
Посмотрю в окно, допишу главу
Первое сентября, дворник жжет листву.
Серым облакам наплевать на нас
Если знаешь как жить- живи
Ты хотела плыть как все - так плыви! '''

def s_5(s):
  print([x for x in s if len(x)5])  # не пойму - как это работает??
s = s.split()

s_5(s)
 
  



            

           

               
            
            
#print(f"длина<5, {len(s) <= 5}")



 
   